dot_emacs.d/init.org
#+TITLE: Emacs Configuration
#+AUTHOR: Martin Lönn Andersson
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Table of Contents
- [[#preamble][Preamble]]
- [[#startup][Startup]]
  - [[#early-init][Early Init]]
  - [[#garbage-collection][Garbage Collection]]
  - [[#define-constants][Define Constants]]
  - [[#os-specific-adaptions][OS-specific Adaptions]]
  - [[#load-path][Load Path]]
  - [[#custom-file][Custom File]]
  - [[#backup-directory][Backup Directory]]
- [[#package-management][Package Management]]
  - [[#package-archives--initialize-package-manager][Package Archives & Initialize Package Manager]]
  - [[#use-package][Use Package]]
  - [[#auto-package-update][Auto Package Update]]
  - [[#diminish][Diminish]]
- [[#global-functionalities][Global Functionalities]]
  - [[#user-information][User Information]]
  - [[#environment-variables][Environment Variables]]
  - [[#swiper][Swiper]]
  - [[#markdown-mode][Markdown Mode]]
  - [[#spell-checking][Spell Checking]]
  - [[#history][History]]
  - [[#undo-tree][Undo Tree]]
  - [[#general][General]]
  - [[#evil][Evil]]
  - [[#hydra][Hydra]]
  - [[#dired][Dired]]
  - [[#help-functionality][Help functionality]]
  - [[#terminal][Terminal]]
  - [[#smooth-scrolling][Smooth Scrolling]]
  - [[#tabs][Tabs]]
- [[#ui-enhancements][UI Enhancements]]
  - [[#font--icons][Font & Icons]]
  - [[#modeline][Modeline]]
  - [[#themes][Themes]]
  - [[#popup-buffers][Popup Buffers]]
  - [[#lines][Lines]]
  - [[#title-bar][Title Bar]]
  - [[#dashboard][Dashboard]]
  - [[#focused-editing][Focused editing]]
  - [[#centered-buffers][Centered buffers]]
- [[#general-programming][General Programming]]
  - [[#prog-mode][Prog Mode]]
  - [[#lsp][LSP]]
  - [[#lsp-ui][LSP UI]]
  - [[#dap][DAP]]
  - [[#flycheck][Flycheck]]
  - [[#completions][Completions]]
  - [[#comments][Comments]]
  - [[#match-delimiters][Match Delimiters]]
  - [[#projectile][Projectile]]
  - [[#magit][Magit]]
- [[#programming][Programming]]
  - [[#java][Java]]
  - [[#python][Python]]
  - [[#tex][TeX]]
- [[#office][Office]]
  - [[#org][Org]]
  - [[#calendar][Calendar]]
  - [[#plantuml--graphviz][PlantUML & Graphviz]]
  - [[#mail][Mail]]
  - [[#pdf-tools][PDF Tools]]
- [[#miscellaneous][Miscellaneous]]
- [[#tangle--reload-on-save][Tangle & Reload On Save]]

* Preamble

Welcome to my Emacs configuration. This is a literate configuration, meaning code and prose are intertwined in order to provide clear documentation. [[https://orgmode.org/worg/org-contrib/babel/][Org Babel]] makes this possible in =org= files, like this one.

This setup is heavily inspired by [[https://github.com/MatthewZMD/.emacs.d][Matthew Zeng's Emacs setup]].

* Startup
** Early Init
*** Defer Garbage Collection

Increase garbage collection memory threshold as early as possible to speed up startup.

#+begin_src emacs-lisp :tangle ./early-init.el

  (setq gc-cons-threshold 100000000)

#+end_src

*** Disable =package-enable-at-startup=

Package initialize occurs automatically, before =user-init-file= is loaded, but after =early-init-file=. We handle package initialization, so we must prevent Emacs from doing it early.

#+begin_src emacs-lisp

  (setq package-enable-at-startup nil)

#+end_src

*** Unset =file-name-handler-alist=

Every file opened and loaded by Emacs will run through this list to check for a proper handler for the file, but during startup, it won’t need any of them.

#+begin_src emacs-lisp

  (defvar file-name-handler-alist-original file-name-handler-alist)
  (setq file-name-handler-alist nil)

#+end_src

*** Hide UI Elements

Disabling them here before they've been initialized.

#+begin_src emacs-lisp :tangle ./early-init.el

  (setq inhibit-startup-message t
        initial-scratch-message nil)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (blink-cursor-mode -1)

#+end_src

*** Emacs Server

Run Emacs as a [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html][server]].

#+begin_src emacs-lisp :tangle ./early-init.el

  (require 'server)
  (if (not (server-running-p)) (server-start))

#+end_src

** Garbage Collection

A large ~gc-cons-threshold~ may cause freezing and stuttering during long-term interactive use.

If you experience freezing, decrease this amount, if you experience stuttering, increase this amount.

#+begin_src emacs-lisp

  (defvar better-gc-cons-threshold 4294967269; 512mb
    "The default value to use for `gc-cons-threshold'.

  If you experience freezing, decrease this.  If you experience stuttering, increase this.")

  (add-hook 'emacs-startup-hook
            (lambda () (setq gc-cons-threshold better-gc-cons-threshold)))

#+end_src

Garbage Collect when Emacs is out of focus and avoid garbage collection when using minibuffer.

#+begin_src emacs-lisp

  (add-hook 'emacs-startup-hook
        (lambda ()
          (if (boundp 'after-focus-change-function)
          (add-function :after after-focus-change-function
                (lambda ()
                  (unless (frame-focus-state)
                    (garbage-collect))))
        (add-hook 'after-focus-change-function 'garbage-collect))
          (defun gc-minibuffer-setup-hook ()
        (setq gc-cons-threshold (* better-gc-cons-threshold 2)))

          (defun gc-minibuffer-exit-hook ()
        (garbage-collect)
        (setq gc-cons-threshold better-gc-cons-threshold))

          (add-hook 'minibuffer-setup-hook #'gc-minibuffer-setup-hook)
          (add-hook 'minibuffer-exit-hook #'gc-minibuffer-exit-hook)))

#+end_src

** Define Constants

#+begin_src emacs-lisp

  (defconst *sys/linux*
    (eq system-type 'gnu/linux)
    "Are we running on a GNU/Linux system?")

  (defconst *sys/mac*
    (eq system-type 'darwin)
    "Are we running on a Mac system?")

#+end_src

** OS-specific Adaptions
*** Linux

Set super key to meta on Linux.

#+begin_src emacs-lisp

  (when *sys/linux*
    (setq x-super-keysym 'meta))

#+end_src

*** Mac

Set meta key, turn off option key as modifier, set dired to not use ~--dired~ flag with ~ls~ on macOS.

#+begin_src emacs-lisp

  (when *sys/mac*
    (setq mac-command-modifier 'meta)
    (setq mac-option-modifier 'none)
    (setq dired-use-ls-dired nil)
    (setq frame-resize-pixelwise t)
    (add-to-list 'default-frame-alist '(undecorated . t)))

#+end_src

** Load Path

Set load path to include ~./elisp~ folder and ensure theme is remembered by loading ~custom.el~.

#+begin_src emacs-lisp

  (defun update-to-load-path (folder)
    "Update FOLDER and its subdirectories to `load-path'."
    (let ((base folder))
      (unless (member base load-path)
    (add-to-list 'load-path base))
      (dolist (f (directory-files base))
    (let ((name (concat base "/" f)))
      (when (and (file-directory-p name)
             (not (equal f ".."))
             (not (equal f ".")))
        (unless (member base load-path)
          (add-to-list 'load-path name)))))))

  (update-to-load-path (expand-file-name "elisp" user-emacs-directory))

  (load-file "~/.emacs.d/custom.el")

#+end_src

** Custom File

Customize-based settings should live in ~custom.el~ file.

#+begin_src emacs-lisp

  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file 'noerror)

#+end_src

** Backup Directory

Set backup directory location.

#+begin_src emacs-lisp

  (setq backup-directory-alist
    `((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
    `((".*" ,temporary-file-directory t)))

#+end_src

* Package Management
** Package Archives & Initialize Package Manager

Set up MELPA, ELPA and Non-GNU ELPA and initialize the package manager.

#+begin_src emacs-lisp

  (setq package-archives
    '(("melpa" . "https://melpa.org/packages/")
      ("elpa" . "https://elpa.gnu.org/packages/")
      ("nongnu" . "https://elpa.nongnu.org/nongnu/")
      ("melpa-stable" . "https://stable.melpa.org/packages/")))

  (package-initialize)

#+end_src
** Use Package

A nicer way to set up packages with [[https://github.com/jwiegley/use-package][use-package]]. Make sure =use-package= is installed, refresh package contents, always ensure packages are installed and turn on verbose logging.

#+begin_src emacs-lisp

  ;; ensure use-package is installed
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (require 'use-package)
  (setq
   use-package-always-ensure t
   use-package-verbose t)

#+end_src

** Auto Package Update

Automatically update packages every seven days with [[https://github.com/rranelli/auto-package-update.el][auto-package-update]].

#+begin_src emacs-lisp

  (use-package auto-package-update
    :if (not (daemonp))
    :custom
    (auto-package-update-interval 7) ;; in days
    (auto-package-update-prompt-before-update t)
    (auto-package-update-delete-old-versions t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe))

#+end_src

** Diminish

[[https://github.com/emacsmirror/diminish][Diminish]] hides minor modes from the modeline.

#+begin_src emacs-lisp

  (use-package diminish
    :diminish visual-line-mode
    :diminish centered-window-mode
    :diminish eldoc-mode
    :diminish evil-collection-unimpaired-mode
    :diminish org-indent-mode
    :diminish lsp-lens-mode
    :diminish lsp-modeline-workspace-status-mode)

#+end_src

* Global Functionalities
** User Information

#+begin_src emacs-lisp

  (setq user-full-name "Martin Lönn Andersson")
  (setq user-mail-address "mlonna@pm.me")

#+end_src

** Environment Variables

Get environment variables from shell with [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]].

#+begin_src emacs-lisp

  (use-package exec-path-from-shell
    :config
    ;; which environment variables to import
    (dolist (var '("LANG" "LC_ALL"))
      (add-to-list 'exec-path-from-shell-variables var))
    (exec-path-from-shell-initialize))

#+end_src

** Swiper

[[https://github.com/abo-abo/swiper/tree/master][Swiper]] provides search functionality.

#+begin_src emacs-lisp

  (use-package swiper :diminish)

#+end_src

** Markdown Mode

The [[https://jblevins.org/projects/markdown-mode/][markdown mode]] package provides better markdown support.

#+begin_src emacs-lisp

    (use-package markdown-mode :defer t)

#+end_src

** Spell Checking

To spell check files, I use =flyspell= and =hunspell= in order to spell check in both Swedish and English.

*Prerequisites*:

1. Install [[https://github.com/hunspell/hunspell][hunspell]].
2. Install dictionary files.
2. Create a personal dictionary file =~/.hunspell_personal=.

#+begin_src emacs-lisp

  (use-package flyspell
    :diminish flyspell-mode
    :hook
    ((markdown-mode org-mode text-mode) . flyspell-mode)
    (prog-mode . flyspell-prog-mode)
    :bind
    ("C-l" . flyspell-auto-correct-previous-word)
    :config
    (with-eval-after-load "ispell"
      (setenv "LANG" "en_US.UTF-8")
      (setq ispell-program-name "hunspell"
            ispell-dictionary "en_US,sv")

      ;; ispell-set-spellchecker-params has to be called before ispell-hunspell-add-multi-dic
      (ispell-set-spellchecker-params)
      (ispell-hunspell-add-multi-dic "en_US,sv")
      (setq ispell-personal-dictionary "~/.hunspell_personal")))

#+end_src

** History

#+begin_src emacs-lisp

  ;; save text entered in minibuffer prompts
  (setq history-length 25)
  (savehist-mode 1)

  ;; save cursor position in files
  (save-place-mode 1)

  ;; remember recently edited files
  (recentf-mode 1)

  ;; auto reload non-file buffers
  (setq global-auto-revert-non-file-buffers t)

#+end_src

