dot_emacs.d/init.org
** Undo Tree

[[https://www.emacswiki.org/emacs/UndoTree][Undo Tree]] treats undo history as a branching tree of changes.

#+begin_src emacs-lisp

  (use-package undo-tree
    :defer t
    :diminish undo-tree-mode
    :init (global-undo-tree-mode)
    :custom
    (undo-tree-visualizer-diff t)
    (undo-tree-history-directory-alist `(("." . ,(expand-file-name ".backup" user-emacs-directory))))
    (undo-tree-visualizer-timestamps t))

#+end_src

** General

An easier way to set keybindings is with [[https://github.com/noctuid/general.el][general]].

#+begin_src emacs-lisp

  (use-package general
    :config
    ;; leader key for hydras
    (general-create-definer my/leader-keys
      :keymaps '(normal visual emacs)
      :prefix ","
      :global-prefix ",")

    ;; make esc quit prompts
    (general-define-key
     "<escape>" 'keyboard-escape-quit)

    (general-define-key
     "C-=" #'text-scale-increase
     "C-+" #'text-scale-increase
     "C--" #'text-scale-decrease))

#+end_src

** Evil

[[https://github.com/emacs-evil/evil][Evil]] provides Vi emulation for Emacs, as well as surround functionality with [[https://github.com/emacs-evil/evil-surround][evil-surround]].

#+begin_src emacs-lisp

  (use-package evil
    :diminish
    :demand t
    :bind
    ("C-z" . evil-local-mode)

    (:map evil-normal-state-map
          ("C-w h" . evil-window-left)
          ("C-w j" . evil-window-down)
          ("C-w k" . evil-window-up)
          ("C-w l" . evil-window-right))

    :hook
    (evil-mode . my/evil-hook)

    :init
    (setq evil-want-integration t
          evil-want-keybinding nil
          evil-want-C-u-scroll t
          evil-want-C-i-jump nil
          evil-search-module 'evil-search)

    :config
    (defun my/evil-hook () ; modes to disable evil in
      (dolist (mode '(custom-mode
                      eshell-mode
                      git-rebase-mode
                      erc-mode
                      term-mode
                      ansi-term-mode))
        (add-to-list 'evil-emacs-state-modes mode)))

    (evil-mode +1)

    ;; move on visual lines unless a count is involved
    (with-eval-after-load 'evil
      (evil-define-motion evil-next-line (count)
        "Move the cursor COUNT screen lines down."
        :type line
        (let ((line-move-visual (unless count t)))
          (evil-line-move (or count 1))))

      (evil-define-motion evil-previous-line (count)
        "Move the cursor COUNT lines up."
        :type line
        (let ((line-move-visual (unless count t)))
          (evil-line-move (- (or count 1))))))

    :custom
    (evil-undo-system 'undo-tree)

    ;; horizontal movement crosses lines
    (evil-cross-lines t))

  ;; more vim keybindings (in non-file buffers)
  (use-package evil-collection
    :after evil
    :diminish evil-collection-unimpaired-mode
    :config
    (evil-collection-init))

  ;; even even more vim keybindings (adds surround functionality)
  (use-package evil-surround
    :config
    (global-evil-surround-mode +1))

#+end_src

** Hydra

[[https://github.com/abo-abo/hydra][Hydra]] provides temporary command buffers.

#+begin_src emacs-lisp

  (use-package hydra
    :config
    (my/leader-keys
      "t" '(hydra-theme/body :which-key "choose theme")
      "r" '(hydra-window/body :which-key "resize window")
      "s" '(hydra-text-scale/body :which-key "scale text")))

#+end_src

*** Choose Theme

#+begin_src emacs-lisp

  (defhydra hydra-theme (:timeout 4)
    "choose theme"
    ("l" (my/enable-theme 'standard-light) "standard-light")
    ("v" (my/enable-theme 'modus-vivendi) "modus-vivendi")
    ("t" (my/enable-theme 'doom-tokyo-night) "tokyo night")
    ("f" nil "finished" :exit t))

  (defun my/disable-all-themes ()
    "Disable all active themes."
    (dolist (theme custom-enabled-themes)
      (disable-theme theme)))

  (defun my/enable-theme (theme)
    "Enable the specified THEME and disable all other themes."
    (my/disable-all-themes)
    (load-theme theme t)
    (customize-save-variable 'my-chosen-theme theme))

  (add-hook 'after-init-hook
            (lambda ()
              (if (boundp 'my-chosen-theme)
                  (my/enable-theme my-chosen-theme)
                (my/enable-theme 'modus-vivendi))))

#+end_src

*** Resize Window

#+begin_src emacs-lisp

  (defhydra hydra-window (:timeout 4)
    "resize window"
    ("h" (window-width-decrease) "decrease width")
    ("j" (window-height-increase) "increase height")
    ("k" (window-height-decrease) "decrease height")
    ("l" (window-width-increase) "increase width")
    ("f" nil "finished" :exit t))

  ;; resizes the window width based on the input
  (defun resize-window-width (w)
    "Resizes the window width based on W."
    (interactive (list (if (> (count-windows) 1)
                           (read-number "Set the current window width in [1~9]x10%: ")
                         (error "You need more than 1 window to execute this function!"))))
    (message "%s" w)
    (window-resize nil (- (truncate (* (/ w 10.0) (frame-width))) (window-total-width)) t))

  ;; resizes the window height based on the input
  (defun resize-window-height (h)
    "Resizes the window height based on H."
    (interactive (list (if (> (count-windows) 1)
                           (read-number "Set the current window height in [1~9]x10%: ")
                         (error "You need more than 1 window to execute this function!"))))
    (message "%s" h)
    (window-resize nil (- (truncate (* (/ h 10.0) (frame-height))) (window-total-height)) nil))

  (defun resize-window (width delta)
    "Resize the current window's size.  If WIDTH is non-nil, resize width by some DELTA."
    (if (> (count-windows) 1)
        (window-resize nil delta width)
      (error "You need more than 1 window to execute this function!")))

  ;; shorcuts for window resize width and height
  (defun window-width-increase ()
    (interactive)
    (resize-window t 5))

  (defun window-width-decrease ()
    (interactive)
    (resize-window t -5))

  (defun window-height-increase ()
    (interactive)
    (resize-window nil 5))

  (defun window-height-decrease ()
    (interactive)
    (resize-window nil -5))

#+end_src

*** Scale Text

#+begin_src emacs-lisp

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

#+end_src

** Dired

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :hook (dired-mode . (lambda () (dired-hide-details-mode)))
    :bind ("C-x C-j" . dired-jump)
    :custom
    (dired-free-space nil)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-find-file)
    (use-package nerd-icons-dired ; use nerd icons in dired
    :diminish
    :hook
    (dired-mode . nerd-icons-dired-mode)))


#+end_src

** Help functionality
*** Counsel and Ivy

[[https://github.com/abo-abo/swiper][Counsel and Ivy]] provide generic completion and enhanced versions of common Emacs commands.

#+begin_src emacs-lisp

  ;; helpful ui additions
  (use-package counsel
    :diminish
    :bind
    ("M-x" . counsel-M-x)
    ("C-M-j" . counsel-switch-buffer)
    ("C-x C-f" . counsel-find-file)

    :config
    (counsel-mode +1))

  (use-package ivy
    :diminish
    :bind
    ("C-s" . swiper)
    (:map ivy-switch-buffer-map
          ("C-d" . ivy-switch-buffer-kill))
    (:map ivy-reverse-i-search-map
          ("C-d" . ivy-reverse-i-search-kill))

    :config
    (ivy-mode 1)
    ;; hide "^" from ivy minibuffer
    (setq ivy-initial-inputs-alist nil))

  ;; helpful information for functions in minibuffers
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

  ;; command history for ivy
  (use-package prescient)

  ;; ivy integration for prescient
  (use-package ivy-prescient
    :init
    (ivy-prescient-mode 1))

#+end_src

*** Helpful

A more detailed help buffer with [[https://github.com/Wilfred/helpful][helpful]].

#+begin_src emacs-lisp

  ;; more detailed help pages
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

*** Which Key

[[https://github.com/justbur/emacs-which-key][Which Key]] displays available keybindings in a popup buffer.

#+begin_src emacs-lisp

  ;; display help for next command keystroke
  (use-package which-key
    :diminish
    :config
    (which-key-mode 1))

#+end_src

