dot_emacs.d/init.org
** Terminal

A better terminal emulation with [[https://github.com/akermu/emacs-libvterm][vterm]].

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :bind ("C-x t" . vterm)
    :custom
    (term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (vterm-shell "zsh")
    (vterm-max-scrollback 10000))

#+end_src

** Smooth Scrolling

#+begin_src emacs-lisp

  (setq scroll-step 1
        scroll-margin 1
        scroll-conservatively 101
        scroll-up-aggressively 0.01
        scroll-down-aggressively 0.01
        auto-window-vscroll nil
        fast-but-imprecise-scrolling nil
        mouse-wheel-scroll-amount '(1 ((shift) . 1))
        mouse-wheel-progressive-speed nil
        hscroll-step 1
        hscroll-margin 1)

#+end_src

** Perspective

Workspaces: [[https://github.com/nex3/perspective-el][perspective]].

#+begin_src emacs-lisp

  (use-package perspective
    :hook (persp-created . dashboard-open)
    :bind
    ("C-x C-b" . persp-list-buffers)
    :custom
    (persp-mode-prefix-key (kbd "C-c M-p"))
    :init
    (persp-mode))

  (use-package persp-projectile
    :after perspective)

#+end_src

* UI Enhancements
** Font & Icons

#+begin_src emacs-lisp

  (add-to-list 'default-frame-alist '(font . "Ubuntu Mono-17"))

#+end_src

*Prerequisite*: Install nerd icons with =M-x nerd-icons-install-fonts=.

#+begin_src emacs-lisp

  (use-package nerd-icons)

#+end_src

** Themes

#+begin_src emacs-lisp

  (use-package standard-themes)

  (use-package doom-themes)

  ;; disable border around modelines
  (custom-set-faces
   '(mode-line ((t (:box nil))))
   '(mode-line-inactive ((t (:box nil)))))

#+end_src

** Popup Buffers

Popup buffers with [[https://github.com/karthink/popper][popper]].

#+begin_src emacs-lisp

  (use-package popper
    :bind
    ("C-å"   . popper-toggle)
    ("M-å"   . popper-cycle)
    ("C-M-å" . popper-toggle-type)
    :init
    (setq popper-reference-buffers
      '("\\*Messages\\*"
        "\\*Warnings\\*"
        "\\*Compile-Log\\*"
        "^\\*compilation.*\\*$" comint-mode
        "Output\\*$"
        help-mode
        helpful-mode
        compilation-mode
        "\\*Async Shell Command\\*"
        "^\\*eshell.*\\*$" eshell-mode
        "^\\*shell.*\\*$"  shell-mode
        "^\\*term.*\\*$"   term-mode
        "^\\*vterm.*\\*$"  vterm-mode
        "^\\*ansi-term.*\\*$"  ansi-term-mode
        "^\\*tex-shell.*\\*$"
        "^\\*Flycheck.*\\*$"
        "^\\*Buffer List*\\*$"))
    (popper-mode 1)
    (popper-echo-mode 1)
    (setq popper-mode-line " POP "))

#+end_src

** Lines

#+begin_src emacs-lisp

  ;; turn on line numbers and highlight current line
  (dolist (hook '(fundamental-mode conf-mode-hook prog-mode-hook text-mode-hook markdown-mode-hook org-mode-hook))
    (add-hook hook 'display-line-numbers-mode)
    )

  ;; relative line numbers
  (setq display-line-numbers-type 'relative)

#+end_src

** Dashboard

The [[https://github.com/emacs-dashboard/emacs-dashboard][Dashboard]] package displays a customizable dashboard.

#+begin_src emacs-lisp

  (use-package dashboard
    :demand t
    :diminish (dashboard-mode page-break-lines-mode)
    :custom-face
    (dashboard-items-face ((t (:weight normal))))
    :custom
    (dashboard-items '((bookmarks . 7)
                       (projects . 5)))
    :config
    (dashboard-setup-startup-hook)

    (setq dashboard-center-content t
          dashboard-set-footer nil
          dashboard-display-icons-p t
          dashboard-projects-switch-function 'counsel-projectile-switch-project-by-name))

  ;; hook dashboard-open to creation of new frame
  (add-hook 'after-make-frame-functions
          (lambda (frame)
            (with-selected-frame frame
              (dashboard-open))))


#+end_src

** Centered Buffers

[[https://github.com/mpwang/perfect-margin][perfect-margin]] makes some buffers centered.

#+begin_src emacs-lisp

  (use-package perfect-margin
    :diminish
    :custom
    (perfect-margin-visible-width 100)
    :config
    (perfect-margin-mode t)
    (setq perfect-margin-ignore-modes
          '(dired-mode)))

#+end_src

* General Programming
** Prog Mode

#+begin_src emacs-lisp

  (use-package prog-mode
    :ensure nil
    :mode ("\\.edn\\'" "\\.lua\\'"))

#+end_src

** LSP

Programming functionalities with [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]], a client/library for the Language Server Protocol.

*Prerequisite*: Install the required [[https://emacs-lsp.github.io/lsp-mode/page/languages/][language servers]].

#+begin_src emacs-lisp

  (use-package lsp-mode
    :commands lsp
    :diminish lsp-lens-mode
    :hook
    ((java-mode tex-mode) . lsp-deferred)

    :custom
    (lsp-keymap-prefix "C-c l")
    (lsp-auto-guess-root nil)
    (lsp-prefer-flymake nil) ; use flycheck instead of flymake
    (lsp-enable-file-watchers nil)
    (lsp-enable-folding nil)
    (read-process-output-max (* 1024 1024))
    (lsp-keep-workspace-alive nil)
    (lsp-enable-which-key-integration t)

    ;; headerline breadcrumb
    (lsp-headerline-breadcrumb-segments '(path-up-to-project file))
    (lsp-headerline-breadcrumb-mode)

    :bind
    (:map lsp-mode-map ("C-c C-f" . lsp-format-buffer))

    :config
    (setq lsp-headerline-breadcrumb-icons-enable nil
          lsp-modeline-code-actions-enable nil
          lsp-signature-auto-activate t
          lsp-signature-render-documentation t
          lsp-modeline-diagnostics-enable nil
          lsp-eldoc-enable-hover t)

    (defun lsp-update-server ()
      "Update LSP server."
      (interactive)
      ;; equals to `C-u M-x lsp-install-server'
      (lsp-install-server t))

    ;; ivy integration
    (use-package lsp-ivy
      :after lsp)

    ;; treemacs integration
    (use-package lsp-treemacs
      :after lsp))

#+end_src

** LSP UI

[[https://github.com/emacs-lsp/lsp-ui][lsp-ui]] provides all higher level UI modules for lsp-mode.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :after lsp-mode
    :diminish
    :commands lsp-ui-mode
    :custom-face
    (lsp-ui-doc-background ((t (:background nil))))
    (lsp-ui-doc-header ((t (:inherit (font-lock-string-face italic)))))
    :bind
    (:map lsp-ui-mode-map
          ("M-r" . lsp-ui-peek-find-definitions)
          ("M-?" . lsp-ui-peek-find-references)
          ("C-c u" . lsp-ui-imenu)
          ("M-i" . lsp-ui-doc-glance))
    :custom
    (lsp-ui-doc-header t)
    (lsp-ui-doc-include-signature t)
    (lsp-ui-doc-border (face-foreground 'default))
    (lsp-ui-sideline-enable nil)
    (lsp-ui-sideline-ignore-duplicate t)
    (lsp-ui-sideline-show-code-actions nil)
    :config
    ;; use lsp-ui-doc-webkit only in GUI
    (when (display-graphic-p)
      (setq lsp-ui-doc-use-webkit t)))

#+end_src

** DAP

[[https://github.com/emacs-lsp/dap-mode][Debug Adapter Protocol Mode]], a client/library for the Debug Adapter Protocol.

#+begin_src emacs-lisp

  (use-package dap-mode
    :diminish
    :bind
    (:map dap-mode-map
          (("<f12>" . dap-debug)
           ("<f8>" . dap-continue)
           ("<f9>" . dap-next)
           ("<M-f11>" . dap-step-in)
           ("C-M-<f11>" . dap-step-out)
           ("<f7>" . dap-breakpoint-toggle))))

#+end_src

** Flycheck

A syntax checking extension.

#+begin_src emacs-lisp

  (use-package flycheck
    :defer t
    :diminish
    :hook (lsp-mode . flycheck-mode)
    :commands (flycheck-add-mode)
    :bind ("C-c f e" . flycheck-list-errors)
    :custom
    (flycheck-emacs-lisp-load-path 'inherit)
    (flycheck-indication-mode (if (display-graphic-p) 'left-fringe))
    :init
    (if (display-graphic-p)
        (use-package flycheck-posframe
          :custom-face
          (flycheck-posframe-face ((t (:foreground ,(face-foreground 'success)))))
          (flycheck-posframe-info-face ((t (:foreground ,(face-foreground 'success)))))
          :hook (flycheck-mode . flycheck-posframe-mode)
          :custom
          (flycheck-posframe-position 'window-bottom-left-corner)
          (flycheck-posframe-border-width 3)
          (flycheck-posframe-inhibit-functions
           '((lambda (&rest _) (bound-and-true-p company-backend)))))
      (use-package flycheck-pos-tip
        :defines flycheck-pos-tip-timeout
        :hook (flycheck-mode . flycheck-pos-tip-mode)
        :custom (flycheck-pos-tip-timeout 30)))
    :config
    (use-package flycheck-popup-tip
      :hook (flycheck-mode . flycheck-popup-tip-mode))

    (when (fboundp 'define-fringe-bitmap)
      (define-fringe-bitmap 'flycheck-fringe-bitmap-double-arrow
        [16 48 112 240 112 48 16] nil nil 'center)))

#+end_src

** Completions

Programming completions with [[https://github.com/company-mode/company-mode][company]]. [[https://github.com/sebastiencs/company-box][company-box]] provides a front-end with icons.

#+begin_src emacs-lisp

  (use-package company
    :diminish
    :after lsp-mode
    :hook ((prog-mode LaTeX-mode latex-mode) . company-mode)
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :diminish
    :hook (company-mode . company-box-mode))

#+end_src

** Comments

Nice commenting functionality with [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]].

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))

#+end_src

** Match Delimiters

Match delimiters with [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]].

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . (lambda () (rainbow-delimiters-mode))))

#+end_src

** Projectile

Keep track of projects with [[https://github.com/bbatsov/projectile][Projectile]].

#+begin_src emacs-lisp

  (use-package projectile
    :diminish
    :custom (projectile-completion-system 'ivy)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (setq projectile-switch-project-action #'projectile-persp-switch-project)
    :config
    (projectile-mode 1)
    (setq projectile-ignored-projects '("~/.cfg" "~/.emacs.d" "~/Projects/pathfinder")
          projectile-track-known-projects-automatically nil)

    (use-package counsel-projectile
      :config (counsel-projectile-mode 1)))

#+end_src

** Magit

[[https://magit.vc/][Magit]]: a complete text-based user interface to Git

#+begin_src emacs-lisp

  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

#+RESULTS:

* Programming
** Java

Emacs Java IDE with [[https://github.com/emacs-lsp/lsp-java][lsp-java]].

*Prerequisite*: Install [[https://maven.apache.org/download.cgi][Maven]] and ensure it's in PATH.

#+begin_src emacs-lisp

  (use-package lsp-java
    :after lsp-mode
    :if (executable-find "mvn")
    :init
    (use-package request :defer t)
    :custom
    (lsp-java-server-install-dir (expand-file-name "~/.emacs.d/eclipse.jdt.ls/server/"))
    (lsp-java-workspace-dir (expand-file-name "~/.emacs.d/eclipse.jdt.ls/workspace/")))

#+end_src
** Python

#+begin_src emacs-lisp

  (use-package python-mode
    :ensure nil
    :after flycheck
    :mode "\\.py\\'"
    :custom
    (python-indent-offset 4)
    (flycheck-python-pycompile-executable "python3")
    (python-shell-interpreter "python3"))

#+end_src

