dot_emacs.d/init.el

(use-package vterm
  :commands vterm
  :bind ("C-x t" . vterm)
  :custom
  (term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
  (vterm-shell "zsh")
  (vterm-max-scrollback 10000))

(setq scroll-step 1
      scroll-margin 1
      scroll-conservatively 101
      scroll-up-aggressively 0.01
      scroll-down-aggressively 0.01
      auto-window-vscroll nil
      fast-but-imprecise-scrolling nil
      mouse-wheel-scroll-amount '(1 ((shift) . 1))
      mouse-wheel-progressive-speed nil
      hscroll-step 1
      hscroll-margin 1)

(use-package perspective
  :hook (persp-created . dashboard-open)
  :bind
  ("C-x C-b" . persp-list-buffers)
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))
  :init
  (persp-mode))

(use-package persp-projectile
  :after perspective)

(add-to-list 'default-frame-alist '(font . "Jetbrains Mono-15"))

(use-package nerd-icons)

(use-package standard-themes)

(use-package doom-themes)

;; disable border around modelines
(custom-set-faces
 '(mode-line ((t (:box nil))))
 '(mode-line-inactive ((t (:box nil)))))

(use-package popper
  :bind
  ("C-å"   . popper-toggle)
  ("M-å"   . popper-cycle)
  ("C-M-å" . popper-toggle-type)
  :init
  (setq popper-reference-buffers
    '("\\*Messages\\*"
      "\\*Warnings\\*"
      "\\*Compile-Log\\*"
      "^\\*compilation.*\\*$" comint-mode
      "Output\\*$"
      help-mode
      helpful-mode
      compilation-mode
      "\\*Async Shell Command\\*"
      "^\\*eshell.*\\*$" eshell-mode
      "^\\*shell.*\\*$"  shell-mode
      "^\\*term.*\\*$"   term-mode
      "^\\*vterm.*\\*$"  vterm-mode
      "^\\*ansi-term.*\\*$"  ansi-term-mode
      "^\\*tex-shell.*\\*$"
      "^\\*Flycheck.*\\*$"
      "^\\*Buffer List*\\*$"))
  (popper-mode 1)
  (popper-echo-mode 1)
  (setq popper-mode-line " POP "))

;; turn on line numbers and highlight current line
(dolist (hook '(fundamental-mode conf-mode-hook prog-mode-hook text-mode-hook markdown-mode-hook org-mode-hook))
  (add-hook hook 'display-line-numbers-mode)
  )

;; relative line numbers
(setq display-line-numbers-type 'relative)

(use-package dashboard
  :demand t
  :diminish (dashboard-mode page-break-lines-mode)
  :custom-face
  (dashboard-items-face ((t (:weight normal))))
  :custom
  (dashboard-items '((bookmarks . 7)
                     (projects . 5)))
  :config
  (dashboard-setup-startup-hook)

  (setq dashboard-center-content t
        dashboard-set-footer nil
        dashboard-display-icons-p t
        dashboard-projects-switch-function 'projectile-persp-switch-project))

;; hook dashboard-open to creation of new frame
(add-hook 'after-make-frame-functions
        (lambda (frame)
          (with-selected-frame frame
            (dashboard-open))))

(use-package perfect-margin
  :diminish
  :custom
  (perfect-margin-visible-width 100)
  :config
  (perfect-margin-mode t)
  (setq perfect-margin-ignore-modes
        '(dired-mode)))

(use-package prog-mode
  :ensure nil
  :mode ("\\.edn\\'" "\\.lua\\'"))

(use-package eglot)

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package rainbow-delimiters
  :hook (prog-mode . (lambda () (rainbow-delimiters-mode))))

(use-package projectile
  :diminish
  :custom (projectile-completion-system 'ivy)
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (setq projectile-switch-project-action #'projectile-dired)
  :config
  (projectile-mode 1)
  (setq projectile-ignored-projects '("~/.cfg" "~/.emacs.d" "~/Projects/pathfinder")
        projectile-track-known-projects-automatically nil)

  (use-package counsel-projectile
    :config (counsel-projectile-mode 1)))

(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package eglot-java)

(use-package tex
  :ensure auctex
  :defer t
  :custom
  (TeX-auto-save t)
  (TeX-parse-self t)
  (TeX-master nil)
