dot_emacs.d/init.el
  ;; to use pdfview with auctex
  (TeX-view-program-selection '((output-pdf "pdf-tools"))
                             TeX-source-correlate-start-server t)
  (TeX-view-program-list '(("pdf-tools" "TeX-pdf-tools-sync-view")))
  (TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
  :hook
  (LaTeX-mode . (lambda ()
                  (turn-on-reftex)
                  (reftex-isearch-minor-mode)
                  (setq reftex-plug-into-AUCTeX t
                        TeX-PDF-mode t
                        TeX-source-correlate-method 'synctex
                        TeX-source-correlate-start-server t))))

(use-package org
  :pin nongnu
  :ensure org-contrib ; needed for org-contacts
  :hook (org-mode . org-indent-mode)
  :bind (("C-c a" . org-agenda)
         ("C-c c" . org-capture)
         ("C-c l" . org-store-link))
  :config
  (setq org-directory "~/Documents/notes/org"
        org-default-notes-file (concat org-directory "/capture.org")
        org-todo-keywords '((sequence "TODO" "NEXT" "|" "DONE"))
        org-tags-column 0
        org-startup-folded t
        org-export-backends '(md org ascii html icalendar latex odt rss)
        org-ellipsis " ▾")

  ;; remap org indentation keys
  (with-eval-after-load 'org
    (general-define-key
     :keymaps 'org-mode-map
     "C-c i" 'org-metaright
     "C-c u" 'org-metaleft)))

;; change default bullets
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(use-package toc-org
  :hook (org-mode . toc-org-mode))

(use-package org-agenda
  :ensure nil
  :after org
  :config
  (setq org-agenda-span 'day
        org-agenda-tags-column 0
        org-agenda-start-on-weekday nil
        org-agenda-skip-scheduled-if-deadline-is-shown t
        org-agenda-skip-deadline-if-done t
        org-agenda-skip-scheduled-if-done t
        org-agenda-todo-list-sublevels t
        ;; org element cache often produced errors, so I disabled it
        org-element-use-cache nil
        org-agenda-scheduled-leaders '("" "")  ; hide "Scheduled" text
        org-agenda-prefix-format "  %?-12t% s" ; hide category for agenda items

        ;; add newline above date heading
        org-agenda-format-date
        (lambda (date)
          (concat "\n" (org-agenda-format-date-aligned date)))

        ;; time grid settings
        org-agenda-time-grid
        '((daily today require-timed remove-match)
          (800 1000 1200 1400 1600 1800 2000)
          "...." "------------")
        org-agenda-current-time-string
        "← now")

  (setq org-agenda-custom-commands
        '(("s" "Super agenda"
           ((agenda "" ((org-agenda-span 'day)
                        (org-super-agenda-groups
                         '((:name "Schedule"
                                  :time-grid t)
                           (:name "Vanor"
                                  :habit t)
                           (:name "Overdue"
                                  :deadline past
                                  :scheduled past)
                           (:name "Studier"
                                  :and (:category "studier" :scheduled today)
                                  :and (:category "studier" :deadline today))
                           (:name "Privat"
                                  :and (:category ("privat" "capture" "computer") :scheduled today)
                                  :and (:category ("privat" "capture" "computer") :deadline today))
                           (:discard (:anything t))))))
            (alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:name "Priority Items"
                                   :priority>= "C")
                            (:name "Upcoming Deadlines"
                                   :deadline future)
                            (:discard (:anything t))))))))))

  ;; date heading settings
  (custom-set-faces
   '(org-agenda-date ((t (:height 1.0 :weight bold :background nil))))
   '(org-agenda-date-today ((t (:height 1.3 :weight bold :background nil :underline nil))))))

(use-package org-super-agenda
  :after org-agenda
  :config
  (org-super-agenda-mode 1))

(use-package org-capture
  :ensure nil
  :after org
  :config
  ;; don't save org capture bookmarks
  (setq org-bookmark-names-plist nil
        org-capture-bookmark nil)
  :custom
  (org-capture-templates
   '(
     ("t" "Task" entry (file "")
      "* TODO %?\n  %i\n")

     ("l" "Task with link" entry (file "")
      "* TODO %?\n  %i\n %a")

     ("n" "Note" entry (file "")
      "* %?\n %i\n")

     ("e" "Calendar event" entry (file "calendar.org")
      "* %?\n %^t")

     ("b" "Book" entry (file+headline "backlog.org" "Books")
      "* %?\n %i\n")

     ("m" "Movie" entry (file+headline "backlog.org" "Movies")
      "* %?\n %i\n")

     ("w" "Web" entry (file+headline "backlog.org" "Web")
      "* %i\n%U\n\n")

     ("c" "Contact" entry (file "")
      "* %?
        :PROPERTIES:
        :PHONE: %^{phone number}
        :ADDRESS: %^{Street name Street no., Postal Code Postal Area, Country}
        :BIRTHDAY: %^{yyyy-mm-dd}
        :EMAIL: %^{name@domain.com}
        :NOTE: %^{NOTE}
        :END:"))))

(use-package org-habit
  :ensure nil
  :after org
  :config
  (setq org-habit-show-habits-only-for-today t)

  ;; the org habit graph changes colors per theme,
  ;; so I define consistent colors for the habit graph
  (custom-set-faces
   '(org-habit-clear-face ((t (:background "#1468de"))))
   '(org-habit-clear-future-face ((t (:background "#1468de"))))
   '(org-habit-ready-face ((t (:background "#14de4a"))))
   '(org-habit-ready-future-face ((t (:background "#14de4a"))))
   '(org-habit-alert-face ((t (:background "#f0f00c"))))
   '(org-habit-alert-future-face ((t (:background "#f0f00c"))))
   '(org-habit-overdue-face ((t (:background "#f00c0c"))))
   '(org-habit-overdue-future-face ((t (:background "#f00c0c"))))))

(use-package org-contacts
  :after org
  :custom (org-contacts-files '("~/Documents/notes/org/contacts.org")))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (java . t)))

(setq org-confirm-babel-evaluate nil)
(org-babel-tangle-file "~/.emacs.d/init.org")

;; block templates
(setq org-structure-template-alist
      '(("l" . "src emacs-lisp")
        ("j" . "src java")
        ("s" . "src")
        ("e" . "example")
        ("q" . "quote")))

(use-package calfw
  :config
  ;; use swedish calendar
  (load "sv-kalender"))

;; integrate calfw with org
(use-package calfw-org
  :after calfw)

;; open calendar with two weeks view
(defun my/custom-open-calendar ()
  (interactive)
  (cfw:open-calendar-buffer
   :contents-sources
   (list
    (cfw:org-create-source "medium purple"))
   :view 'two-weeks))

(my/leader-keys
  "c" '(my/custom-open-calendar :which-key "open calendar"))
